{
    "assistant": [
        {
            "answers": [
                "1--More or less", 
                "2--Don't joke,today is a dramatic day"
            ], 
            "id": 1, 
            "text": "Hi, Drogo. How was speaking with Colonel today? Like walking barefoot on burning coals?"
        }, 
        {
            "answers": [], 
            "id": 2, 
            "text": "1--If you survived to a chat with Colonel this morning, next mission will be a joke for you"
        }, 
        {
            "answers": [], 
            "id": 3, 
            "text": "2--I was trying to make you laugh. You look very tired, today. At least, have a coffee!"
        }, 
        {
            "answers": [
                "Yes, Melissa"
            ], 
            "id": 4, 
            "text": "Do you want a quick overview on next mission?"
        }, 
        {
            "answers": [
                "I can do it!"
            ], 
            "id": 5, 
            "text": "Oh, you called with my name! You learnt good manners! Anyway, let's be serious: we need to rebuild all that stuff, and quickly. Every time you call a constructor on a point, drones take a day to start the building, but complete it only if it is in the right position and if the whole schedule doesn't take more than 9 days. Apparently, there are 18 areas where you can build towers or cannons, ordered from left to right, but you have to discover by yourself the right positions."
        }
    ], 
    "colonel": [
        {
            "answers": [
                "1--How could this happen?", 
                "2--And I've to rebuild all?"
            ], 
            "id": 1, 
            "text": "Today is a very dramatic day. That cowards and uncivilized Barbarians attacked during the night time and destroyed all our towers and cannons."
        }, 
        {
            "answers": [
                "..."
            ], 
            "id": 2, 
            "text": "1--Major Guidi fell asleep during his guard duty. He has been hanged at dawn."
        }, 
        {
            "answers": [
                "Thank you, Sir"
            ], 
            "id": 3, 
            "text": "2--I would be glad to order you this, but I'm not stupid. You're a programmer, not a bricklayer"
        }, 
        {
            "answers": [
                "Builder drones?"
            ], 
            "id": 4, 
            "text": "Clearly your mission is to rebuild all our towers and cannons, but to do so, you'll reprogram our builder drones."
        }, 
        {
            "answers": [
                "What is the problem, Sir?"
            ], 
            "id": 5, 
            "text": "Yes, Lieutenent, we do have builder drones. But their source code is not efficient enough: as it is, they would take at least 36 days to rebuild all."
        }, 
        {
            "answers": [
                "Yes, Sir!"
            ], 
            "id": 6, 
            "text": "2--THE PROBLEM WE CAN'T SUSTAIN 36 DAYS WITHOUT ALL OUR DEFENSIVE APPARATUS. I give you 9 days, not a single minute more."
        }
    ], 
    "crazy_doctor": [
        {
            "answers": [
                "Are you their creator?"
            ], 
            "id": 1, 
            "text": "Finding hard to play with those drones?"
        }, 
        {
            "answers": [
                "1--Yes, please", 
                "2--No, I'll contact the seller."
            ], 
            "id": 2, 
            "text": "Nono, we bought them used on eBay, sent from China. Anyway this mission can seem a little bit obscure for you. May I help you?"
        }, 
        {
            "answers": [
                "Gilbert, you're a real genius!"
            ], 
            "id": 3, 
            "text": "1--Let's put all pieces together: first, you have 9 days of time for the whole job. Every time you invoke \"new castle(i)\" or \"new antiMissileBattery(i)\" a counter gets incremented by 1, if at the end of the program it's greater than 9, the building won't take place. Second, our fortress have 18 building slots, if you choose the wrong position the building won't take place. The correct positions for towers are 3, 5, 7, 11, 13, 15; for cannons are 1, 9, 17. And please, PLEASE, use loops!"
        }, 
        {
            "answers": [], 
            "id": 4, 
            "text": "2--I like your sense of humor. Bye bye, young man."
        }
    ]
}