{
    "assistant": [
        {
            "answers": [
                "1--I'm waitin' for invasion of locusts", 
                "2--I'was dancing in my bed"
            ], 
            "id": 1, 
            "text": "Eventful night, Captain Drogo, wasn't it?"
        }, 
        {
            "answers": [
                "Maybe is my negative influence"
            ], 
            "id": 2, 
            "text": "1--Yeah, it's been hard times, since you arrived"
        }, 
        {
            "answers": [
                "It wasn't my shift"
            ], 
            "id": 3, 
            "text": "2--Oh, little princess Drogo sleeps, instead of helping his fellows in the night watch"
        }, 
        {
            "answers": [
                "Any advice?"
            ], 
            "id": 4, 
            "text": "Anyway, I retrieved these new building drones. They have a different behavior than the previous ones: their source code cannot contain loops, you have to do all recursively."
        }, 
        {
            "answers": [], 
            "id": 5, 
            "text": "Having the experience of previous mission, we know that towers have to be placed on slots 3, 5, 7, 11, 13, 15 and cannons on 1, 9 and 17. Don't waste time!"
        }
    ], 
    "colonel": [
        {
            "answers": [
                "I see"
            ], 
            "id": 1, 
            "text": "Good Morning Captain Drogo. It's not a good morning, actually. As you surely noticed this night an earthquake heavily damaged our castle and our defensive apparatus."
        }, 
        {
            "answers": [
                "What should I do?"
            ], 
            "id": 2, 
            "text": "Again, you have to reprogram our drones to rebuild towers and cannons. Unluckily you cannot use the same program, because drones you previously used has been damaged by earthquake."
        }, 
        {
            "answers": [
                "Yes, Sir!"
            ], 
            "id": 3, 
            "text": "Sub-Lieutenant Kazushi have found others drones, she'll explain you everything"
        }, 
        {
            "answers": [
                "I'll do my best, Sir!"
            ], 
            "id": 4, 
            "text": "Also this time we must rebuild everything as quick as possible. I give you 9 days."
        }
    ], 
    "crazy_doctor": [
        {
            "answers": [
                "I admit it"
            ], 
            "id": 1, 
            "text": "Cannot figure out how recursion works, kid?"
        }, 
        {
            "answers": [
                "1--Yes, Gilbert", 
                "2--No, I want to try again"
            ], 
            "id": 2, 
            "text": "It should be quite simple for you, at this point, anyway, do you need my advices?"
        }, 
        {
            "answers": [
                "Thank you, Gilbert"
            ], 
            "id": 3, 
            "text": "1--You can call me Jibi, we are friends, by now. What are you missing in this code? Do you remember that every time a constructor is called, you lose 1 day? And that you upper limit is 9? So maybe you just need to put an if for the castle constructor and an if for the AntiMissileBattery constructor, to execute them only if you are in the right slot. Another useful function is console.log(x): it prints in browser's console the value of x. In this case you can use it to discover the value passed to the function, when it's called."
        }, 
        {
            "answers": [], 
            "id": 4, 
            "text": "2--You're very touchy, I didn't want to offend you, offering my help. Bye, kid."
        }
    ]
}