{
    "assistant": [
        {
            "answers": [
                "Let's defeat these Barbarians!"
            ], 
            "id": 1, 
            "text": "Ready for your last mission, Sir?"
        }, 
        {
            "answers": [
                "Any advice?"
            ], 
            "id": 2, 
            "text": "The system you have to rebuild, deals with choosing the right cannon to shoot to a given enemy missile. For example, if you shoot to a missile in the right hand side of the landscape, the system made the rightmost cannon shoot. The original systems took care of the case in which a cannon has no missiles loaded: if a cannon is empty, you must shoot from the nearest of the ones with loaded missiles."
        }, 
        {
            "answers": [
                "Yes, Melissa, let's start!"
            ], 
            "id": 3, 
            "text": "To check if a cannon has missiles, use use the method hasMissile() on an cannon; you can select a cannon with antiMissileBatteries[index]. You have to use firedToOuterThird(x, y, z), with x, y and z priorities that you choose to assign to cannons. This method returns the loaded cannon with highest priority. Another method is firedtoMiddleThird(x, y), that makes the same thing, but for only two cannons. I know that it difficult Drogo, but you can do it, we can do it: we can win this war, together."
        }
    ], 
    "colonel": [
        {
            "answers": [
                "That's good news, Sir!"
            ], 
            "id": 1, 
            "text": "Good Morning Major Drogo. We won the last battle, but unluckily, not the war. Anyway we can clearly see that the enemy is weak and demotivated. I'm quite sure that their next attack will be the last."
        }, 
        {
            "answers": [
                "To fix it, sir?"
            ], 
            "id": 2, 
            "text": "Not at all, Major. The fact is that during last tremendous fight, the system that governed with cannon has to shoot, got broken. A battle in such conditions is unsustainable. You know what I'm going to ask you?"
        }, 
        {
            "answers": [
                "Yes, Sir!"
            ], 
            "id": 3, 
            "text": "Not exactly. We lost all the schemes of that system, so you have to rebuild it from scratch. And, like always, in the battle we cannot lose a single tower: we have no resources to rebuild them. Go: this will be probably your last mission here."
        }
    ], 
    "crazy_doctor": [
        {
            "answers": [
                "When you interrupted me?"
            ], 
            "id": 1, 
            "text": "You were walking straight to happy ending, when..."
        }, 
        {
            "answers": [
                "1--Help me, instead of fooling me", 
                "2--I don't need your help, Jibi"
            ], 
            "id": 2, 
            "text": "When you dealt with your low programming capacities"
        }, 
        {
            "answers": [], 
            "id": 3, 
            "text": "1--It's very simple: your function must include three cases, one if you have to shoot in in first third of the landscape, one if you have to shoot in the second third and one, guess what, for shooting in the third third. You can obtain this easily from CANVAS_WIDTH. firedToOuterThird is useful when you want to shoot in the leftmost or in the rightmost third, same function but inverted priorities. When you shoot to the second third, the central, use always the central cannon, until it has missiles. Then you can divide the landscape in two sides and use firedtoMiddleThird."
        }, 
        {
            "answers": [], 
            "id": 4, 
            "text": "2--If you're so sure, I will remain silent. But remember: the outcome of a decennial war depends of you."
        }
    ]
}