{
    "assistant": [
        {
            "answers": [
                "Sure"
            ],
            "id": 1,
            "text": "Hi newbie, I'm your assistant, Sub-Lieutenent Melissa Kazushi. I'm here at the front from last year, so I had the time to document myself on our Antimissile System. If you need some generic help on the mission, you just need to ask."
        },
        {
            "answers": [
                "I can do it",
                "Tell me more for this mission"
            ],
            "id": 2,
            "text": "The whole system is written in an ancient and misterious programming language, that many years ago, computer scientist use to call Javascript"
        },
        {
            "answers": [],
            "id": 3,
            "text": "We we'll see. Hope you are as bold as lucky. Fighting Barbars is not a game."
        },
        {
            "answers": [],
            "id": 4,
            "text": "You have to increase the speed of our missiles. Looks like it's enough to find the right variable, in this portion of the system code, and change its value."
        }
    ],
    "colonel": [
      {
          "answers": [
            "I'm so sorry, Sir",
            "I'll fix it, Sir"
          ],
          "id": 1,
          "text": "Good morning, Lieutenent Drogo, and congratulations for completing previous mission. Unluckily, your lack of experience damaged our Antimissile System: your missiles were too fast for our old System and last battle damaged the targeting system."
      },
        {
          "answers": [
              "Yes Sir!"
              "May I skip push-ups?"
          ],
            "id": 2,
            "text": "200 push-ups of punishment, fix the targeting system and you'll be forgiven."
        },
        {
            "answers":[],
            "id": 3,
            "text": "Be quick, Barbarians won't wait for you and they surely will defeat us, with our targeting system broken."
        },
        {
          "answers": [
              "Yes Sir!"
          ],
            "id": 4,
            "text": "Also in this mission you can't lose any of our towers. I hope won't have to repeat it every time."
        }
    ],
    "crazy_doctor": [
        {
            "answers": [
                "Who are you?"
            ],
            "id": 1,
            "text": "It seems you're in trouble, kid..."
        },
        {
            "answers": [
                "I'm Atheist",
                "I can't see wings"
            ],
            "id": 2,
            "text": "I'm your Guardian Angel!"
        },
        {
            "answers": [],
            "id": 3,
            "text": "I was joking, boy, I'm Doctor Gilbert Nichols, and many many years ago, when you weren't born already and Internet Explorer was considered a good Browser, I was in the team or programmers that created your Antimissile System"
        },
        {
            "answers": [
                "Yes, please",
                "No, I can do it by myself"
            ],
            "id": 4,
            "text": "Let's go to the point: I see that you've been defeated many times in this mission. Do you want some help? I can give you very specific hints"
        },
        {
            "answers": [],
            "id": 5,
            "text": "In that case, I'll won't say a word."
        },
        {
            "answers": [],
            "id": 6,
            "text": "Okay, let reason using phisics: think that the function called \"scale\" should return the time that a missile takes to reach the target. If you want to lower this time, what you have to increase?"
        }
    ]
}
