{
    "assistant": [
        {
            "answers": [], 
            "id": 1, 
            "text": "1--Okay, Lieutenent, are you ready for the new mission? As you'll already know, we have to fix that old and rusty autoload mechanism"
        }, 
        {
            "answers": [], 
            "id": 2, 
            "text": "2--As you prefer, newbie. So, let's ignore formalities. As you'll already know, we have to fix that old and rusty autoload mechanism"
        }, 
        {
            "answers": [
                "Yes, please"
            ], 
            "id": 3, 
            "text": "After a couple of battles, I think that you can trust me. Shall I give you my opinion?"
        }, 
        {
            "answers": [], 
            "id": 4, 
            "text": "The code seems generally correct, maybe there are just some details to be fixed and some little things that are missing"
        }
    ], 
    "colonel": [
        {
            "answers": [
                "I'm born ready, sir!"
            ], 
            "id": 1, 
            "text": "Good morning, Lieutenent Drogo, this time you completed last mission without any unpleasant sideffect. Are you ready for next mission?"
        }, 
        {
            "answers": [
                "1--What is my mission sir?", 
                "2--So what?"
            ], 
            "id": 2, 
            "text": "Peace is temporary in these dangerous times. As you can see, after latest battles, we only have one missile in our cannons."
        }, 
        {
            "answers": [
                "Yes Sir! Consider it as done!"
            ], 
            "id": 3, 
            "text": "1--Your mission is to adjust and run the mechanism that autoloads the missiles in our cannons."
        }, 
        {
            "answers": [
                "YESSIR!"
            ], 
            "id": 4, 
            "text": "2--SO WHAT? First, always call me Sir. Second, don't dare to reply to me in such a arrogant way, or you'll be given to Barbarians as a breakfast cookie. Third, go to fix the mechanism that autoloads missiles in our cannons. NOW."
        }
    ], 
    "crazy_doctor": [
        {
            "answers": [
                "Hi Gilbert, just in time!"
            ], 
            "id": 1, 
            "text": "Are you waitin' for an advice, boy?"
        }, 
        {
            "answers": [
                "1--Yes, time is running out", 
                "2--No, please, talk me about the weather"
            ], 
            "id": 2, 
            "text": "You want me to go direct to the point?"
        }, 
        {
            "answers": [
                "1--Thank you Gilbert!"
            ], 
            "id": 3, 
            "text": "1--I'll let you know something that will be very useful also in next missions: you code console is smart. Not smart as its creator -me, modestly- but cant help you while you're coding: it highlights key words and, on the left of line numbers, tells you if there's something wrong. I said enough, for today"
        }, 
        {
            "answers": [], 
            "id": 4, 
            "text": "2-- The weather is sunny, with maximum degrees near to 35C. And since you're so nice with me, I won't help you for this mission."
        }
    ]
}