{
    "assistant": [
        {
            "answers": [
                "You're always very nice with me", 
                "It's not my fault"
            ], 
            "id": 1, 
            "text": "Hi newbie, you thought you were pretty good, after defeating Barbarians in last battle, but you caused more harm than good"
        }, 
        {
            "answers": [
                "1--Yes, please", 
                "2--No, just wanted to say hi"
            ], 
            "id": 2, 
            "text": "Anyway, why are you calling me? Do you need some help?"
        }, 
        {
            "answers": [], 
            "id": 3, 
            "text": "1-- If you look at the code, it seems that some operations are performed on the coordinates you choose to shoot at, but I'm not sure they're all necessaries. Start checking this!"
        }, 
        {
            "answers": [], 
            "id": 4, 
            "text": "2-- Don't waste time. Enemy is close!"
        }
    ], 
    "colonel": [
        {
            "answers": [
                "I'm so sorry, Sir", 
                "I'll fix it, Sir"
            ], 
            "id": 1, 
            "text": "Good morning, Lieutenant Drogo, and congratulations for completing previous mission. Unluckily, your lack of experience damaged our Antimissile System: your missiles were too fast for our old cannons and it ended up damaging the whole targeting component of our Anti Missilistic System."
        }, 
        {
            "answers": [
                "Yes Sir!", 
                "May I skip push-ups?"
            ], 
            "id": 2, 
            "text": "200 push-ups of punishment, fix the targeting system and you'll be forgiven."
        }, 
        {
            "answers": [
                "Yes Sir!"
            ], 
            "id": 3, 
            "text": "Be quick, Barbarians won't wait for you and they surely will defeat us, with our targeting system broken."
        }, 
        {
            "answers": [], 
            "id": 4, 
            "text": "Also in this mission you can't lose any of our towers. I hope won't have to repeat it every time."
        }
    ], 
    "crazy_doctor": [
        {
            "answers": [
                "I admit it"
            ], 
            "id": 1, 
            "text": "You're in trouble, again kid..."
        }, 
        {
            "answers": [
                "1--I am afraid to say yes", 
                "2--You're not my favorite in any field"
            ], 
            "id": 2, 
            "text": "And you need your favorite Doctor's help?"
        }, 
        {
            "answers": [
                "Got it"
            ], 
            "id": 3, 
            "text": "1--First rule of modifying someone else's code: understand what the code does. event.pageX and event.pageY are the coordinates, we subtract to them offLeft and offTop, to correct the screen positioning, but what's the sense of these other numbers, it there's any? Reflect kid, reflect."
        }, 
        {
            "answers": [], 
            "id": 4, 
            "text": "2-- Calm down boy, there's a solution for everything. If you are too proud for listening to me, I won't annoy you anymore."
        }, 
        {
            "answers": [], 
            "id": 5, 
            "text": "2-- Calm down boy, there's a solution for everything. If you too proud to listen to me, I won't annoy you anymore."
        }
    ]
}