{
    "assistant": [
        {
            "answers": [
                "1--No more jokes, today?", 
                "2--Don't worry, we'll fix everything"
            ], 
            "id": 1, 
            "text": "Good Morning Lieutenant, ehm, Captain"
        }, 
        {
            "answers": [
                "We'll fix everything, Melissa"
            ], 
            "id": 2, 
            "text": "1--I'm so sorry, sigh, I thought that this program could be useful, sigh, and enemy is so close, sigh"
        }, 
        {
            "answers": [
                "Don't worry"
            ], 
            "id": 3, 
            "text": "2--Oh, you're so kind with me, sigh"
        }, 
        {
            "answers": [
                "Any advice?"
            ], 
            "id": 4, 
            "text": "Okay, let's examine the situation: we had this program, that checked if the point where you choose to shoot at was too close or too far. We have to restore that functionality and destroy all these time-flow functionalities."
        }, 
        {
            "answers": [
                "You've been very useful!"
            ], 
            "id": 5, 
            "text": "I think that you should keep checking if the height, otherwise the program is completely useless and I'm not sure it will work."
        }
    ], 
    "colonel": [
        {
            "answers": [
                "Yes, Sir", 
                "YESSIR!"
            ], 
            "id": 1, 
            "text": "Good Morning Captain Drogo. You really deserved this rank promotion after last successful mission. Anyway, the enemy never sleeps: are you ready for next mission?"
        }, 
        {
            "answers": [
                "What effect has, this project?"
            ], 
            "id": 2, 
            "text": "This time you have to repare a damage done by Sub-Lieutenant Kazushi. She found and executed and old and experimental project for our cannons, the result is that actually we are not ready to fight."
        }, 
        {
            "answers": [
                "Are you joking, sir?"
            ], 
            "id": 3, 
            "text": "I know that it will be hard to believe, for you, but it stops the flow of time."
        }, 
        {
            "answers": [
                "I'll do my best, Sir!"
            ], 
            "id": 4, 
            "text": "No, I don't. It was a very dangerous and experimental experiment, done many many years ago by our team of scientists. You have to revert it to the previous behavior, when it was a simple program that decided not to shoot if the target was to close or too far."
        }, 
        {
            "answers": [], 
            "id": 5, 
            "text": "Let's hope it's enough. I can see that Barbarians are preparing another attack."
        }
    ], 
    "crazy_doctor": [
        {
            "answers": [
                "Not so much, really"
            ], 
            "id": 1, 
            "text": "Hey boy, having fun with time traveling?"
        }, 
        {
            "answers": [
                "1--Clearly", 
                "2--No, I can do it by myself"
            ], 
            "id": 2, 
            "text": "It is made by tons of lines of code. Do you need my help to figure out the solution?"
        }, 
        {
            "answers": [
                "Thank you, Gilbert"
            ], 
            "id": 3, 
            "text": "1--Your mission is to revert this big mess, to a simple function that checks if the x are too high or too low. I think that you can save just the two outer loops and it should work."
        }, 
        {
            "answers": [], 
            "id": 4, 
            "text": "2--Good luck, boy. We were drinking all a lot of Vodka when we programmed that stuff."
        }
    ]
}