{
    "assistant": [
        {
            "answers": [
                "1--I'm scared of nothing", 
                "2--I'm not sure I can do it"
            ], 
            "id": 1, 
            "text": "Tough mission, this time, isn't it?"
        }, 
        {
            "answers": [
                "I like your sense of humor"
            ], 
            "id": 2, 
            "text": "1--Oh, you're such a brave man, Drogo! I really admire you."
        }, 
        {
            "answers": [
                "You're right"
            ], 
            "id": 3, 
            "text": "2--Oh, come on! You fixed a time travel machine, now you think you're not good enough to build a double cannon?!?"
        }, 
        {
            "answers": [
                "Which function I must use?"
            ], 
            "id": 4, 
            "text": "Let's be serious now. I examined the function that rules the cannon until now, it doesn't seems too difficult to replicate."
        }, 
        {
            "answers": [
                "Let's do it!"
            ], 
            "id": 5, 
            "text": "You can create a missile to a given point with a command like this: new PlayerMissile (source,height,width). Such a command must be placed inside the array of your missiles, playerMissiles, with the command push. Others recommendations are: don't forget to use checkHeight, to determine the cannon which has to shoot with whichAntiMissileBattery (and to return if whichAntiMissileBattery has returned -1). Let's go and try, Captain!"
        }
    ], 
    "colonel": [
        {
            "answers": [
                "1--I'm honored by your request", 
                "2--I fear I'm not good enough"
            ], 
            "id": 1, 
            "text": "Good Morning Captain Drogo. I have a new kind of mission for you: until now, your mission consisted in correcting o reformulating someone else's code. Today, I'll ask you to design something entirely new, from scratch."
        }, 
        {
            "answers": [
                "I won't, Sir!"
            ], 
            "id": 2, 
            "text": "1--Don't make me regret to trust you for this fundamental task"
        }, 
        {
            "answers": [
                "Thank you, Sir!"
            ], 
            "id": 3, 
            "text": "2--Don't be modest, you already proved your valor in many battles"
        }, 
        {
            "answers": [
                "Which kind of weapon?"
            ], 
            "id": 4, 
            "text": "As you probably noticed, Barbarians' missiles have increased in number and speed in latest attacks. We have to build a new weapon, to counterattack."
        }, 
        {
            "answers": [
                "Yes, Sir!"
            ], 
            "id": 5, 
            "text": "My suggestion is to build a double shoot cannon, able to shoot two missiles at a time. In that way, we can destroy easily an higher number of enemy missiles. Sub-Lieutenant Kazushi will give you all the necessary details."
        }
    ], 
    "crazy_doctor": [
        {
            "answers": [
                "You, old nosy!"
            ], 
            "id": 1, 
            "text": "Did your friend Melissa gave you all necessary instructions?"
        }, 
        {
            "answers": [
                "1--Yes, help me Jibi", 
                "2--No, I think I can do it"
            ], 
            "id": 2, 
            "text": "Did you find hard to complete this job"
        }, 
        {
            "answers": [
                "Your help is always precious!"
            ], 
            "id": 3, 
            "text": "1--Let's go to the point, it seems that you had precise indications, but, as Romans used to say, \"Repetita iuvat\": to create a new missile at a specified position, call playerMissiles.push( new PlayerMissile( source, x, y ) ) . If you want to create 2 missiles at a time, it's enough to call this function two times for every click. I suggest you not to exaggerate with a triple or fourfold cannon: you'll only waste missiles. I also suggest to shift the position of the second missile adding a constant number to the x, while creating the missile."
        }, 
        {
            "answers": [], 
            "id": 4, 
            "text": "2--Okay, kid, I see you're quite confident in your knowledge. Bye byeee."
        }
    ]
}